icecast-customindex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-12 Sat 22:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>icecast custom index page</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">icecast custom index page</h1>
<p>
we can specify a custom <code>xsl</code> file for the index
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;xsl:stylesheet xmlns:xsl = "http://www.w3.org/1999/XSL/Transform" version = "1.0"&gt;
&lt;xsl:output omit-xml-declaration="no" method="xml" doctype-public="-//W3C//DTD XHTML 1.0 Strict//EN" doctype-system="http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd" indent="yes" encoding="UTF-8" /&gt;
&lt;xsl:template match = "/icestats"&gt;
&lt;html xmlns="http://www.w3.org/1999/xhtml"&gt;
&lt;head&gt;
	&lt;title&gt;radio&lt;/title&gt;
	&lt;link rel="stylesheet" type="text/css" href="index.css" /&gt;
	&lt;meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes" /&gt;
&lt;/head&gt;
&lt;body&gt;
	&lt;!--end index header menu --&gt;
	&lt;xsl:text disable-output-escaping="yes"&gt;
	&amp;lt;!-- WARNING:
	 DO NOT ATTEMPT TO PARSE ICECAST HTML OUTPUT!
	 The web interface may change completely between releases.
	 If you have a need for automatic processing of server data,
	 please read the appropriate documentation. Latest docs:
	 https://icecast.org/docs/icecast-latest/icecast2_stats.html
	--&gt;
	&lt;/xsl:text&gt;
	&lt;!--mount point stats--&gt;
	&lt;xsl:for-each select="source"&gt;
		&lt;xsl:choose&gt;
			&lt;xsl:when test="listeners"&gt;
			&lt;div class="roundbox"&gt;
				&lt;div class="mounthead"&gt;
					&lt;h3 class="mount"&gt;&lt;xsl:value-of select="@mount" /&gt;&lt;/h3&gt;
				&lt;/div&gt;
				&lt;div class="mountcont"&gt;
					&lt;xsl:if test="server_type and ((server_type = 'application/ogg') or (server_type = 'audio/ogg'))"&gt;
						&lt;div class="audioplayer"&gt;
							&lt;audio controls="controls" preload="none"&gt;
								&lt;source src="{@mount}" type="{server_type}" /&gt;
							&lt;/audio&gt;
						&lt;/div&gt;
					&lt;/xsl:if&gt;
					&lt;table class="yellowkeys"&gt;
						&lt;tbody&gt;
							&lt;tr&gt;
								&lt;td&gt;Currently playing:&lt;/td&gt;
								&lt;td class="streamstats"&gt;
								&lt;xsl:if test="artist"&gt;
									&lt;xsl:value-of select="artist" /&gt; - 
								&lt;/xsl:if&gt;
									&lt;xsl:value-of select="title" /&gt;
								&lt;/td&gt;
							&lt;/tr&gt;
						&lt;/tbody&gt;
					&lt;/table&gt;
				&lt;/div&gt;
			&lt;/div&gt;
			&lt;/xsl:when&gt;
			&lt;xsl:otherwise&gt;
				&lt;h3&gt;&lt;xsl:value-of select="@mount" /&gt; - Not Connected&lt;/h3&gt;
			&lt;/xsl:otherwise&gt;
		&lt;/xsl:choose&gt;
	&lt;/xsl:for-each&gt;
&lt;/body&gt;
&lt;/html&gt;
&lt;/xsl:template&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
and add some css
</p>

<div class="org-src-container">
<pre class="src src-css">html, body {
    height: 100%;
    margin:0;
    padding:0;
    display:flex;
    text-align: center;
    justify-content: center;
    align-items: center;
    background: #141415;
    color: #cdcdcd;
}
</pre>
</div>
</div>
</body>
</html>
